In [4]:
import numpy as np

In [5]:
import pandas as pd

In [6]:
data =np.random.randn(4,3)

In [7]:
data

array([[-0.16957344,  0.15170546,  0.08629874],
       [-0.82541914, -1.56745913, -1.54888574],
       [-1.9982751 ,  1.15071655,  0.55226884],
       [-0.13960214, -0.73333067, -0.70739974]])

In [8]:
data_frame=pd.DataFrame(data)

In [9]:
data_frame

          0         1         2
0 -0.169573  0.151705  0.086299
1 -0.825419 -1.567459 -1.548886
2 -1.998275  1.150717  0.552269
3 -0.139602 -0.733331 -0.707400

In [10]:
new_df =pd.DataFrame(data,index=["Can","nida","ahmet","enes"],columns=["Salary","age","Seniority"])

In [11]:
new_df

         Salary       age  Seniority
Can   -0.169573  0.151705   0.086299
nida  -0.825419 -1.567459  -1.548886
ahmet -1.998275  1.150717   0.552269
enes  -0.139602 -0.733331  -0.707400

In [12]:
new_df.loc["Can"]

Salary      -0.169573
age          0.151705
Seniority    0.086299
Name: Can, dtype: float64

In [13]:
new_df.iloc[0]

Salary      -0.169573
age          0.151705
Seniority    0.086299
Name: Can, dtype: float64

In [14]:
new_df

         Salary       age  Seniority
Can   -0.169573  0.151705   0.086299
nida  -0.825419 -1.567459  -1.548886
ahmet -1.998275  1.150717   0.552269
enes  -0.139602 -0.733331  -0.707400

In [15]:
new_df.iloc[:,0]

Can     -0.169573
nida    -0.825419
ahmet   -1.998275
enes    -0.139602
Name: Salary, dtype: float64

In [16]:
#ADD to Columns

In [17]:
new_df["extra"]=10

In [18]:
new_df

         Salary       age  Seniority  extra
Can   -0.169573  0.151705   0.086299     10
nida  -0.825419 -1.567459  -1.548886     10
ahmet -1.998275  1.150717   0.552269     10
enes  -0.139602 -0.733331  -0.707400     10

In [19]:
new_df.drop("extra",axis=1)

         Salary       age  Seniority
Can   -0.169573  0.151705   0.086299
nida  -0.825419 -1.567459  -1.548886
ahmet -1.998275  1.150717   0.552269
enes  -0.139602 -0.733331  -0.707400

In [20]:
new_df

         Salary       age  Seniority  extra
Can   -0.169573  0.151705   0.086299     10
nida  -0.825419 -1.567459  -1.548886     10
ahmet -1.998275  1.150717   0.552269     10
enes  -0.139602 -0.733331  -0.707400     10

In [21]:
new_df

         Salary       age  Seniority  extra
Can   -0.169573  0.151705   0.086299     10
nida  -0.825419 -1.567459  -1.548886     10
ahmet -1.998275  1.150717   0.552269     10
enes  -0.139602 -0.733331  -0.707400     10

In [22]:
new_df.loc["Can"]["Salary"]

np.float64(-0.1695734362202309)

In [23]:
new_df>0

       Salary    age  Seniority  extra
Can     False   True       True   True
nida    False  False      False   True
ahmet   False   True       True   True
enes    False  False      False   True

In [24]:
new_df.loc["Can""Salary"]=50

In [25]:
new_df.drop("CanSalary",inplace=True)

In [26]:
new_df.drop("extra",axis=1,inplace=True)

In [27]:
new_df[new_df>0]

       Salary       age  Seniority
Can       NaN  0.151705   0.086299
nida      NaN       NaN        NaN
ahmet     NaN  1.150717   0.552269
enes      NaN       NaN        NaN

In [28]:
new_df[new_df["Salary"]>0]

Empty DataFrame
Columns: [Salary, age, Seniority]
Index: []

In [29]:
#DataFram INdex Chanching

In [30]:
new_reset=new_df.reset_index()

In [31]:
new_reset

   index    Salary       age  Seniority
0    Can -0.169573  0.151705   0.086299
1   nida -0.825419 -1.567459  -1.548886
2  ahmet -1.998275  1.150717   0.552269
3   enes -0.139602 -0.733331  -0.707400

In [32]:
new_df

         Salary       age  Seniority
Can   -0.169573  0.151705   0.086299
nida  -0.825419 -1.567459  -1.548886
ahmet -1.998275  1.150717   0.552269
enes  -0.139602 -0.733331  -0.707400

In [33]:
new_df["NewIndex"]=["K.CAN","Ş.NIDA","AHMET.G","M.ENES"]

In [34]:
new_df

         Salary       age  Seniority NewIndex
Can   -0.169573  0.151705   0.086299    K.CAN
nida  -0.825419 -1.567459  -1.548886   Ş.NIDA
ahmet -1.998275  1.150717   0.552269  AHMET.G
enes  -0.139602 -0.733331  -0.707400   M.ENES

In [35]:
new_df.set_index("NewIndex",inplace=True)

In [36]:
new_df

            Salary       age  Seniority
NewIndex
K.CAN    -0.169573  0.151705   0.086299
Ş.NIDA   -0.825419 -1.567459  -1.548886
AHMET.G  -1.998275  1.150717   0.552269
M.ENES   -0.139602 -0.733331  -0.707400

In [37]:
new_df2=new_df.set_index([pd.Index(["abc","b","c","d"])])

In [38]:
new_df2

       Salary       age  Seniority
abc -0.169573  0.151705   0.086299
b   -0.825419 -1.567459  -1.548886
c   -1.998275  1.150717   0.552269
d   -0.139602 -0.733331  -0.707400

In [39]:
#MultiIndex

In [40]:
first_index=["Türkiye","Türkiye","Türkiye","Almanya","Almanya","Almanya"]

In [41]:
inner_index=["Adıyaman","Ankara","İstanbul","Berlin","Munchen","Dordmund"]

In [42]:
zipper_list=list(zip(first_index,inner_index))

In [43]:
zipper_list

[('Türkiye', 'Adıyaman'),
 ('Türkiye', 'Ankara'),
 ('Türkiye', 'İstanbul'),
 ('Almanya', 'Berlin'),
 ('Almanya', 'Munchen'),
 ('Almanya', 'Dordmund')]

In [44]:
zipper_list=pd.MultiIndex.from_tuples(zipper_list)

In [45]:
data=np.ones((6,2))

In [46]:
data

array([[1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.],
       [1., 1.]])

In [47]:
dataframe=pd.DataFrame(data,index=zipper_list,columns=["Age","Salary"])

In [48]:
dataframe

                  Age  Salary
Türkiye Adıyaman  1.0     1.0
        Ankara    1.0     1.0
        İstanbul  1.0     1.0
Almanya Berlin    1.0     1.0
        Munchen   1.0     1.0
        Dordmund  1.0     1.0

In [49]:
dataframe.loc["Türkiye"].loc["Adıyaman"]

Age       1.0
Salary    1.0
Name: Adıyaman, dtype: float64